// MyThirdHomework.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <locale.h>

extern const int a;
extern const int b;
extern const int c;
extern const int d;

int main()
{
    float summ = (float) a * (b + (c / d));

    std::cout << summ << std::endl;




    int x, z{ 8 };

    x = (z <= 21) ? z - 21 : (z - 21) * 2;

    std::cout << x << std::endl;




    int Array [3][3][3], * pArr;

    pArr = &Array[1][1][1];
    *pArr = 19;

    std::cout << *pArr << std::endl;

    return 0;
}


// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
